#include "ntc_rv_table.h"
#include "adcx.h"

#define TABLE_SIZE  			181
#define ADC1_CONVDATA_SIZE		8

//NTC-10K-3950-B值
//-55~125摄氏度对应的电阻阻值表(单位:Ω)
//阻值-温度换算:  数组下标索引减去55即为温度值
const u32 g_rvTable[TABLE_SIZE] = {
	1034600, 959006, 889452, 825419, 766434, 											//-55~-51
	712066, 661926, 615656, 572934, 533466, 496983, 463240, 432015, 403104, 376320, 	//-50~-41
	351495, 328472, 307110, 287279, 268859, 251741, 235826, 221021, 207242, 194412, 	//-40~-31
	182460, 171320, 160932, 151241, 142196, 133750, 125859, 118485, 111589, 105139, 	//-30~-21
	99102, 93450, 88156, 83195, 78544, 74183, 70091, 66250, 66643, 59255, 				//-20~-11
	56071, 53078, 50263, 47614, 45121, 42774, 40563, 38480, 36517, 34665, 				//-10~-1
	32919, 																				//0
	31270, 29715, 28246, 26858, 25547, 24307, 23135, 22026, 20977, 19987, 				//1~10
	19044, 18154, 17310, 16510, 15752, 15034, 14352, 13705, 13090, 12507, 				//11~20
	11953, 11427, 10927, 10452, 10000, 9570, 9161, 8771, 8401, 8048, 					//21~30
	7712, 7391, 7086, 6795, 6518, 6254, 6001, 5761, 5531, 5311, 						//31~40
	5102, 4902, 4710, 4528, 4353, 4186, 4026, 3874, 3728, 3588, 						//41~50
	3454, 3326, 3203, 3085, 2973, 2865, 2761, 2662, 2567, 2476, 						//51~60
	2388, 2304, 2223, 2146, 2072, 2000, 1932, 1866, 1803, 1742, 						//61~70
	1684, 1627, 1573, 1521, 1471, 1423, 1377, 1332, 1289, 1248, 						//71~80
	1208, 1170, 1133, 1097, 1063, 1030, 998, 968, 938, 909, 							//81~90
	882, 855, 829, 805, 781, 758, 735, 714, 693, 673, 									//91~100
	653, 635, 616, 599, 582, 565, 550, 534, 519, 505, 									//101~110
	491, 478, 465, 452, 440, 428, 416, 405, 395, 384, 									//111~120
	374, 364, 355, 345, 337																//121~125
};

/**
 * @brief 中值滤波
 * @param collection: 元素集合
 * @param size: 集合大小
 * @retval 中值
 */
u16 mid_filter(u16 *collection, u16 size)
{
	u16 e;
	u16 i, j;
	u8 sorted;
	
	i = 0;
	while(i < size - 1){//冒泡的趟数 
		sorted = 1;
		j = 0;
		while(j < size - 1 - i){//一趟冒的次数 
			
			if(collection[j] > collection[j + 1]){
				e = collection[j];
				collection[j] = collection[j + 1];
				collection[j + 1] = e;
				sorted = 0;
			}
			
			j++;
		}
		if(sorted) break;
		
		i++;
	}
	
	return collection[size / 2];
}

s8 ntc_get_temp(void)
{
	s16 i;
	u32 adcValue;
	float rValue;
	s8 temperature;
	u16 adc_buffer[ADC1_CONVDATA_SIZE];
	
	for(i = 0; i < ADC1_CONVDATA_SIZE; i++)
		adc_buffer[i] = GetAdcAverage(5);

	adcValue = mid_filter(adc_buffer, ADC1_CONVDATA_SIZE);
	rValue = 4095000.0;
	rValue = rValue / adcValue - 1000;
	adcValue = 10000000.0 / rValue;
	for(i = 0; i < TABLE_SIZE; i++) {
		if(adcValue > g_rvTable[i]) {
			temperature = i - 55;
			break;
		}
	}		

	return temperature;
}
